{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"content":1},"\u003Cp>I have a few plates spinning.\u003C/p>\n\u003Ch2>reputablebot - \u003Ca href=\"https://github.com/thejukebox/reputable_bot\">repo\u003C/a>\u003C/h2>\n\u003Cp>reputablebot is a Discord bot I maintain for my server. It's integrated with\n\u003Ca href=\"https://ollama.com\">Ollama\u003C/a>, so its pretty easy to self-host! You can (sorta)\nhave it run a generated RPG for you, which is a crowd favourite.\u003C/p>\n\u003Ch2>Lute - \u003Ca href=\"https://github.com/thejukebox/lute\">repo\u003C/a>\u003C/h2>\n\u003Cp>Lute is intended to be an open-source, self-hosted streaming platform, specifically\nfor audio. It spawned from online D&amp;D sessions, where we always had a hard time\nfinding a place to listen to music together consistently. Platforms that sync YouTube\nstreams are frustrating, because sometimes content is blocked, ads play, or embeds\njust stop working. Instead, we figured why not build a little web radio-esque tool?\u003C/p>\n\u003Cp>It's still in early stages and everyone is pretty busy, but there's progress\nbeing made. You can find the Lute repository \u003Ca href=\"https://github.com/thejukebox/lute\">here\u003C/a>.\u003C/p>\n\u003Ch2>jukebox.rodeo - \u003Ca href=\"https://github.com/thejukebox/jukeboxrodeo\">repo\u003C/a>\u003C/h2>\n\u003Cp>This website is built with Svelte. I don't normally go near web, so it's pretty primitive.\u003C/p>\n\u003Cp>You can find the source for it \u003Ca href=\"https://github.com/thejukebox/jukeboxrodeo\">here\u003C/a>.\u003C/p>\n\u003Ch2>Terabyte Cowboy - \u003Ca href=\"https://terabytecowboy.bandcamp.com/\">bandcamp\u003C/a>\u003C/h2>\n\u003Cp>I make music, usually with synths and eurorack modules\n(\u003Ca href=\"https://vcvrack.com/\">VCV rack is really cool, you should check it out\u003C/a>),\nunder the name Terabyte Cowboy. I have a\n\u003Ca href=\"https://terabytecowboy.bandcamp.com/\">bandcamp\u003C/a> where it goes up for free\nbut it's also pay-what-you-want if you think it's worth cash.\u003C/p>\n"],"uses":{}}]}
